# GetSpreadAngle

## Description
Procedure GetSpreadAngle returns the spread angle of the referenced spot light. &lt;BR&gt;

```pascal
PROCEDURE GetSpreadAngle(
				h                : HANDLE;
				VAR spreadAngleR : REAL);
```

```python

def vs.GetSpreadAngle(h):
    return spreadAngleR
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to light.|
|spreadAngleR|REAL|Returns spread angle of light.|

## Version
Availability: from MiniCAD7.0
## Category
* Objects - Lights